<template>
  <svg
    xmlns="http://www.w3.org/2000/svg"
    viewBox="0 0 200 200"
    :class="className"
    :style="{ width, height }"
  >
    <!-- Внешняя форма (капля/контур) -->
    <path d="M99.8 186.4c-.9 0-1.9-.2-2.7-.7C51.5 161 23.3 113.8 23.3 62.5l0-2.9c-.1-12.6-.2-18.4 5.6-19.6 43.6-9.6 67-28.8 67.2-29 .2-.2 2.1-1.8 7.3 0 .2.2 23.7 19.4 67.2 29 5.8 1.3 5.7 7 5.6 19.7l0 3c0 51.3-28.3 98.5-73.8 123.1-.8.4-1.7.7-2.6.7zm.1-171.3c-.6.2-24.9 20.2-69.9 30.1-1.4.3-1.4 5.6-1.3 14.3l0 3c0 49.3 27.2 94.7 70.9 118.4 44-23.7 71.1-69.1 71.1-118.4l0-3c.1-7.5.1-14-1.3-14.3C124.2 35.3 100.1 15.3 99.9 15.1z"/>

    <!-- Синий круг -->
    <circle cx="99.7" cy="95.1" r="41.5" fill="#148EE9" />

    <!-- Галочка -->
    <path d="M97.6 113.2l-18.3-16c-1.1-1-1.2-2.7-.3-3.8 1-1.1 2.7-1.2 3.8-.3l14 12.2 18.8-24.4c.9-1.2 2.6-1.4 3.8-.5 1.2.9 1.4 2.6.5 3.8L97.6 113.2z"/>
  </svg>
</template>

<script setup lang="ts">
withDefaults(
  defineProps<{
    className?: string
    width?: string
    height?: string
  }>(),
  {
    className: 'w-10 h-10',
    width: undefined,
    height: undefined
  }
)
</script>